# # ; # Логические операторы, подобно арифметическим операторам (+, -, *, /), имеют приоритет выполнения.
# # ;  Приоритет выполнения следующий:
# # ; ; в первую очередь выполняется логическое отрицание not;
# # ; ; далее выполняется логическое умножение and;
# # ; ; далее выполняется логическое сложение or.

# # ; # and - оператор

# # ; ; age = int(input('Сколько вам лет?: '))
# # ; ; grade = int(input('В каком классе вы учитесь?: '))
# # ; ; city = input('В каком городе вы живете?: ')
# # ; ; if age >= 12 and grade >= 7 and city == 'Москва':
# # ; ;     print('Доступ разрешен.')
# # ; ; else:
# # ; ;     print('Доступ запрещен.')


# # ; ; #or - оператор

# # ; ; age = int(input('Сколько вам лет?: '))
# # ; ; grade = int(input('В каком классе вы учитесь?: '))
# # ; ; city = input('В каком городе вы живете?: ')
# # ; ; if age >= 12 and grade >= 7 and (city == 'Москва' or city == 'Санкт-Петербург'):
# # ; ;     print('Доступ разрешен.')
# # ; ; else:
# # ; ;     print('Доступ запрещен.')


# # ; ; #not -оператор

# # ; ; age = int(input('Сколько вам лет?: '))
# # ; ; if not (age < 12):
# # ; ;     print('Доступ разрешен.')
# # ; ; else:
# # ; ;     print('Доступ запрещен.')


# # ; #Задача 1. Напишите программу, которая определяет, является ли заданное натуральное число трёхзначным.
# # ; num = int(input())
# # ; if 100 <= num <= 999:     # num >= 100 and num <= 999
# # ;     print('Число является трёхзначным')
# # ; else:
# # ;     print('Число не является трёхзначным')

# # ; #Задача 2. Напишите программу, которая проверяет, что все три цифры натурального трёхзначного числа различны.
# # ; num = int(input())
# # ; d3 = num % 10
# # ; d2 = num % 100 // 10
# # ; d1 = num // 100
# # ; if d3 != d2 and d3 != d1 and d2 != d1:
# # ;     print('Цифры различны')
# # ; else:
# # ;     print('Цифры не различны')

# # ; #Напишите программу, которая по координатам точки,
# # ; #не лежащей на осях координат, определяет номер координатной четверти, в которой она находится
# # ; x = int(input())
# # ; y = int(input())

# # ; if x > 0 and y > 0:
# # ;     print('1 четверть')
# # ; if x < 0 and y > 0:
# # ;     print('2 четверть')
# # ; if x < 0 and y < 0:
# # ;     print('3 четверть')
# # ; if x > 0 and y < 0:
# # ;     print('4 четверть')


# # a = 2
# # b = 4
# # c = 6

# # l = " " + 28 * "_"
# # f = "| %18s | %5s |"
# # print(l)
# # print(f % ("a == 2 or b > 2", a == 2 or b > 2))
# # print(l)
# # print(f % ("6 <= c and a > 3", 6 <= c and a > 3))
# # print(l)
# # print(f % ("1 != b and c != 3", 1 != b and c != 3))
# # print(l)
# # print(f % ("a >= -1 or a <= b", a >= -1 or a <= b))
# # print(l)
# # print(f % ("not(a > 2)", not(a > 2)))
# # print(l)
# # print(f % ("not(c <= 10)", not(c <= 10)))
# # print(l)

# # a = int(input())

# # if a >= 2 and a <= 17:
# #     b = 3
# #     p = a * a + b * b
# # else:
# #     b = 5

# # p = (a + b) * (a + b)
# # print(p)


# # Вариант 1
# # x = int(input())
# # if (-30 < x and x <= -2) or (7 < x <= 25):
# #     print("Принадлежит")
# # else:
# #     print("Не принадлежит")
# # #Вариант 2
# # n = int(input())
# # print('Принадлежит' if -30 < n <= -2 or 7 < n <= 25 else 'Не принадлежит')
# # #Вариант 3
# # print('Принадлежит' if int(input()) in (list(range(-29, -1)) + list(range(8, 26))) else 'Не принадлежит')


# ##Красивое число
# # num = str(input())
# # if len(num)==4:
# #     if int(num) % 7 == 0 or int(num) % 17 == 0:
# #         print("YES")
# #     else:
# #         print("NO")
# # else:
# #         print("NO")

# # Неравенство треугольника
# # Напишите программу, которая принимает
# # три положительных числа и определяет, существует ли невырожденный треугольник с такими сторонами.

# a, b, c = int(input()), int(input()), int(input())
# if a + b > c and a + c > b and b + c > a:
#     print("YES")
# else:
#     print("NO")

# Високосный год v1
yar = int(input())
if yar % 4 == 0 and yar % 100 != 0 or yar % 400 == 0 :
    print("YES")
else:
    print("NO")

# Високосный год v2
# import calendar
# print("YES" if calendar.isleap(int(input())) else "NO")


